# FbxLightLossFactorCtrl Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FbxLightLossFactorCtrl Property
ParameterTypeId Class See Also
---
"Light Loss Factor"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FbxLightLossFactorCtrl { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FbxLightLossFactorCtrl As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FbxLightLossFactorCtrl {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace